title: Django Framework Exceptions
id: fd435618-981e-4a7c-81f8-sadsa_new_djano
status: stable
description: Detects suspicious Django web application framework exceptions that could
  indicate exploitation attempts
references:
- https://docs.djangoproject.com/en/1.11/ref/exceptions/212
- https://docs.djangoproject.com/en/1.11/topics/logging/#django-security
author: Thomas Patzke
date: 2017/08/05
modified: 2020/09/01
tags:
- attack.initial_access
- attack.t1190
logsource:
  category: application
  product: django
detection:
  keywords:
  - SuspiciousOperation
  - DisallowedHost
  - DisallowedModelAdminLookup
  - DisallowedModelAdminToField
  - DisallowedRedirect
  - InvalidSessionKey
  - RequestDataTooBig
  - SuspiciousFileOperation
  - SuspiciousMultipartForm
  - SuspiciousSession
  - TooManyFieldsSent
  - PermissionDenied
  condition: keywords
falsepositives:
- Application bugs
level: medium
