title: Test rules
id: d33c9b8d-8ccc-489a-8d33-483803425635
status: test
description: Detects enumeration of local or remote network services.
references:
    - test1.ru
    - https://test2.ru
    - https://python.org
    - https://willis.com
author: Dmytro Tarnopolskyi
date: 2018/01/21
modified: 2021/11/27
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: process_creation
    product: macos
detection:
    selection_1:
        Image|endswith:
            - '/nc'
            - '/netcat'
    selection_2:
        Image|endswith:
            - '/nmap'
            - '/telnet'
    filter:
        CommandLine|contains: 'l'
    condition: (selection_1 and not filter) or selection_2
falsepositives:
    - Legitimate administration activities
level: low
